---
kind: method
id: M:Autodesk.Revit.DB.CurveByPointsArray.Insert(Autodesk.Revit.DB.CurveByPoints,System.Int32)
source: html/c88ab019-390a-a787-5ab7-94af903ae18c.htm
---
# Autodesk.Revit.DB.CurveByPointsArray.Insert Method

## Syntax (C#)
```csharp
public virtual void Insert(
	CurveByPoints item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.CurveByPoints`)
- **index** (`System.Int32`)